app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-12-31 01:47:57.739364"], ["updated_at", "2016-12-31 01:47:57.739364"]]
---
  def create
    @student = Student.create(student_params(:first_name, :last_name))